//---------------------------------------------------------------------------//
// 2025.   1.  STL 월 910 목 910					6월 9일 목요일		(14주 1일)
// 2025. 6. 19 기말 시험
// 2025. 5. 12 월요일 - 졸업작품 중간발표
//---------------------------------------------------------------------------//
//  
//  STL Algorithm
// 
// c++20 concept, range, coroutine 등 4가지 큰 변화
//---------------------------------------------------------------------------
// 과제 관련 : adjacent_find
// 
#include <iostream>
#include <algorithm>
#include "save.h"
#include "STRING.h"

extern bool 관찰;

int main( ) 
{


 	save("main.cpp");
}

