//---------------------------------------------------------------------------//
// 2025.   1.  STL 월 910 목 910					5월 12일 월요일		(10주 1일)
// 2025. 6. 19 기말 시험
// 2025. 5. 12 월요일 - 졸업작품 중간발표
//---------------------------------------------------------------------------//
//  반복자 - 
// 
//---------------------------------------------------------------------------
//
// 
#include <iostream>	
#include "save.h"
#include "STRING.h"

extern bool 관찰;

int main( ) 
{
    /*for (const auto& x : C) { // syntatic sugar
        std::cout << x << std::endl;
    }*/

    for ( auto i = C.cbegin(); i != C.cend(); ++i) {
        std::cout << *i << std::endl;
    }_

 	save("main.cpp");
}

