//---------------------------------------------------------------------------//
// 2025.   1.  STL 월 910 목 910					6월 5일 목요일		(13주 2일)
// 2025. 6. 19 기말 시험
// 2025. 5. 12 월요일 - 졸업작품 중간발표
//---------------------------------------------------------------------------//
//  Unordered Associative Container - hash 기반
//  
//  
//---------------------------------------------------------------------------
//
// 
#include <iostream>
#include <unordered_set>
#include "save.h"
#include "STRING.h"

extern bool 관찰;


std::array<int, 2025'0605> a;

int main( ) 
{

 	save("main.cpp");
}

